# NewDWFExportOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewDWFExportOptions Method
Application Class See Also
---
Creates DWF Export options.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWFExportOptions NewDWFExportOptions()
```

Visual Basic
---
```text
Public Function NewDWFExportOptions As DWFExportOptions
```

Visual C++
---
```text
public:
DWFExportOptions^ NewDWFExportOptions()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace